; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	image1 - mode
	infrared2 - mode
	spectrograph0 - mode
	Star3 - direction
	Star6 - direction
	Star12 - direction
	Star7 - direction
	Star14 - direction
	Star0 - direction
	Star5 - direction
	GroundStation11 - direction
	GroundStation1 - direction
	Star13 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	Star10 - direction
	GroundStation8 - direction
	Star9 - direction
	Star15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 image1)
	(calibration_target instrument0 Star14)
	(calibration_target instrument0 Star7)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star12)
	(calibration_target instrument2 Star9)
	(calibration_target instrument2 GroundStation4)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation11)
	(supports instrument3 image1)
	(supports instrument3 infrared2)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 GroundStation4)
	(calibration_target instrument3 Star7)
	(supports instrument4 infrared2)
	(supports instrument4 spectrograph0)
	(supports instrument4 image1)
	(calibration_target instrument4 Star7)
	(calibration_target instrument4 GroundStation11)
	(calibration_target instrument4 Star10)
	(calibration_target instrument4 GroundStation8)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star9)
	(supports instrument5 image1)
	(calibration_target instrument5 Star13)
	(calibration_target instrument5 Star9)
	(calibration_target instrument5 Star0)
	(calibration_target instrument5 GroundStation4)
	(calibration_target instrument5 Star14)
	(supports instrument6 infrared2)
	(supports instrument6 spectrograph0)
	(supports instrument6 image1)
	(calibration_target instrument6 GroundStation4)
	(supports instrument7 image1)
	(supports instrument7 spectrograph0)
	(supports instrument7 infrared2)
	(calibration_target instrument7 Star13)
	(calibration_target instrument7 GroundStation8)
	(calibration_target instrument7 GroundStation1)
	(calibration_target instrument7 GroundStation11)
	(calibration_target instrument7 Star5)
	(supports instrument8 infrared2)
	(supports instrument8 image1)
	(supports instrument8 spectrograph0)
	(calibration_target instrument8 Star9)
	(calibration_target instrument8 GroundStation8)
	(calibration_target instrument8 Star10)
	(calibration_target instrument8 GroundStation2)
	(calibration_target instrument8 GroundStation4)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation4)
)
(:goal (and
	(pointing satellite1 Phenomenon17)
	(have_image Star15 spectrograph0)
	(have_image Phenomenon16 image1)
	(have_image Phenomenon17 infrared2)
))

)

; plan
1. (turn_to satellite1 groundstation4 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 groundstation4)
   goals met: 0 of 4
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 4
3. (calibrate satellite1 instrument3 groundstation4)
   added: (calibrated instrument3)
   goals met: 0 of 4
4. (turn_to satellite1 phenomenon16 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 phenomenon16)
   goals met: 0 of 4
5. (take_image satellite1 phenomenon16 instrument3 image1)
   added: (have_image phenomenon16 image1)
   goals met: 1 of 4
6. (turn_to satellite1 star15 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 star15)
   goals met: 1 of 4
7. (take_image satellite1 star15 instrument3 spectrograph0)
   added: (have_image star15 spectrograph0)
   goals met: 2 of 4
8. (turn_to satellite1 phenomenon17 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 phenomenon17)
   goals met: 3 of 4
9. (take_image satellite1 phenomenon17 instrument3 infrared2)
   added: (have_image phenomenon17 infrared2)
   goals met: 4 of 4
